board707/w80x_arduino/boards.txt
# See: http://code.google.com/p/arduino/wiki/Platforms

menu.cpu_frq=CPU Frequency
#menu.cpu_variant=CPU
menu.opt=Build mode
menu.upload_speed=Upload Speed
menu.erase=Erase Flash
#menu.os_variant=OS

##############################################################
air101.name=Air101
air101.upload.tool=serial_upload
air101.upload.protocol=xmodem
air101.upload.maximum_size=2048576
air101.upload.maximum_data_size=294912
air101.build.mcu=ck804ef
air101.build.board=XT804_Air101
air101.build.core=w806
air101.build.variant=air101
air101.build.mcpu=ck804ef
air101.serial.disableRTS=true
#---------------------------------------
# CPU Frequency
air101.menu.cpu_frq.240MHZ=240MHZ
air101.menu.cpu_frq.240MHZ.build.f_cpu=240000000
air101.menu.cpu_frq.160MHZ=160MHZ
air101.menu.cpu_frq.160MHZ.build.f_cpu=160000000
air101.menu.cpu_frq.80MHZ=80MHZ
air101.menu.cpu_frq.80MHZ.build.f_cpu=80000000
air101.menu.cpu_frq.40MHZ=40MHZ
air101.menu.cpu_frq.40MHZ.build.f_cpu=40000000
air101.menu.cpu_frq.2MHZ=2MHZ
air101.menu.cpu_frq.2MHZ.build.f_cpu=2000000
#---------------------------------------
# Release /Optimise
air101.menu.opt.default=Default (-O2 -g3)
air101.menu.opt.maxspeed=Maximum speed (-O3)
air101.menu.opt.maxspeed.build.flags.optimize=-O3
air101.menu.opt.minsize=Minimum code size ( -Os)
air101.menu.opt.minsize.build.flags.optimize=-Os
air101.menu.opt.debug=Debug (-g)
air101.menu.opt.debug.build.flags.optimize=-Og

#---------------------------------------
# Upload Speed
air101.menu.upload_speed.baud115200=115200
air101.menu.upload_speed.baud115200.upload.speed=115200
air101.menu.upload_speed.baud460800=460800
air101.menu.upload_speed.baud460800.upload.speed=460800
air101.menu.upload_speed.baud921600=921600
air101.menu.upload_speed.baud921600.upload.speed=921600
air101.menu.upload_speed.baud1000000=1000000
air101.menu.upload_speed.baud1000000.upload.speed=1000000
air101.menu.upload_speed.baud2000000=2000000
air101.menu.upload_speed.baud2000000.upload.speed=2000000
#---------------------------------------
# Erase Flash
air101.menu.erase.yes=erase all flash
air101.menu.erase.yes.erase.flash=all
air101.menu.erase.no=no erase
air101.menu.erase.no.erase.flash=none
##############################################################

##############################################################
w800.name=W800
w800.upload.tool=serial_upload
w800.upload.protocol=xmodem
w800.upload.maximum_size=2048576
w800.upload.maximum_data_size=294912
w800.build.mcu=ck804ef
w800.build.board=XT804_W800
w800.build.core=w806
w800.build.variant=w800
w800.build.mcpu=ck804ef
w800.serial.disableRTS=true
#---------------------------------------
# CPU Frequency
w800.menu.cpu_frq.240MHZ=240MHZ
w800.menu.cpu_frq.240MHZ.build.f_cpu=240000000
w800.menu.cpu_frq.160MHZ=160MHZ
w800.menu.cpu_frq.160MHZ.build.f_cpu=160000000
w800.menu.cpu_frq.80MHZ=80MHZ
w800.menu.cpu_frq.80MHZ.build.f_cpu=80000000
w800.menu.cpu_frq.40MHZ=40MHZ
w800.menu.cpu_frq.40MHZ.build.f_cpu=40000000
w800.menu.cpu_frq.2MHZ=2MHZ
w800.menu.cpu_frq.2MHZ.build.f_cpu=2000000
#---------------------------------------
# Release /Optimise
w800.menu.opt.default=Default (-O2 -g3)
w800.menu.opt.maxspeed=Maximum speed (-O3)
w800.menu.opt.maxspeed.build.flags.optimize=-O3
w800.menu.opt.minsize=Minimum code size ( -Os)
w800.menu.opt.minsize.build.flags.optimize=-Os
w800.menu.opt.debug=Debug (-g)
w800.menu.opt.debug.build.flags.optimize=-Og

#---------------------------------------
# Upload Speed
w800.menu.upload_speed.baud115200=115200
w800.menu.upload_speed.baud115200.upload.speed=115200
w800.menu.upload_speed.baud460800=460800
w800.menu.upload_speed.baud460800.upload.speed=460800
w800.menu.upload_speed.baud921600=921600
w800.menu.upload_speed.baud921600.upload.speed=921600
w800.menu.upload_speed.baud1000000=1000000
w800.menu.upload_speed.baud1000000.upload.speed=1000000
w800.menu.upload_speed.baud2000000=2000000
w800.menu.upload_speed.baud2000000.upload.speed=2000000
#---------------------------------------
# Erase Flash
w800.menu.erase.yes=erase all flash
w800.menu.erase.yes.erase.flash=all
w800.menu.erase.no=no erase
w800.menu.erase.no.erase.flash=none
##############################################################

##############################################################
w801.name=W801
w801.upload.tool=serial_upload
w801.upload.protocol=xmodem
w801.upload.maximum_size=2048576
w801.upload.maximum_data_size=294912
w801.build.mcu=ck804ef
w801.build.board=XT804_W801
w801.build.core=w806
w801.build.variant=w801
w801.build.mcpu=ck804ef
w801.serial.disableRTS=true
#---------------------------------------
# CPU Frequency
w801.menu.cpu_frq.240MHZ=240MHZ
w801.menu.cpu_frq.240MHZ.build.f_cpu=240000000
w801.menu.cpu_frq.160MHZ=160MHZ
w801.menu.cpu_frq.160MHZ.build.f_cpu=160000000
w801.menu.cpu_frq.80MHZ=80MHZ
w801.menu.cpu_frq.80MHZ.build.f_cpu=80000000
w801.menu.cpu_frq.40MHZ=40MHZ
w801.menu.cpu_frq.40MHZ.build.f_cpu=40000000
w801.menu.cpu_frq.2MHZ=2MHZ
w801.menu.cpu_frq.2MHZ.build.f_cpu=2000000
#---------------------------------------
# Release /Optimise
w801.menu.opt.default=Default (-O2 -g3)
#w801.menu.opt.release.build.flags.optimize=-Os -flto
w801.menu.opt.maxspeed=Maximum speed (-O3)
w801.menu.opt.maxspeed.build.flags.optimize=-O3
w801.menu.opt.minsize=Minimum code size ( -Os)
w801.menu.opt.minsize.build.flags.optimize=-Os
w801.menu.opt.debug=Debug (-g)
w801.menu.opt.debug.build.flags.optimize=-Og

#---------------------------------------
# Upload Speed
w801.menu.upload_speed.baud115200=115200
w801.menu.upload_speed.baud115200.upload.speed=115200
w801.menu.upload_speed.baud460800=460800
w801.menu.upload_speed.baud460800.upload.speed=460800
w801.menu.upload_speed.baud921600=921600
w801.menu.upload_speed.baud921600.upload.speed=921600
w801.menu.upload_speed.baud1000000=1000000
w801.menu.upload_speed.baud1000000.upload.speed=1000000
w801.menu.upload_speed.baud2000000=2000000
w801.menu.upload_speed.baud2000000.upload.speed=2000000
#---------------------------------------
# Erase Flash
w801.menu.erase.yes=erase all flash
w801.menu.erase.yes.erase.flash=all
w801.menu.erase.no=no erase
w801.menu.erase.no.erase.flash=none
##############################################################

##############################################################
w802.name=W802
w802.upload.tool=serial_upload
w802.upload.protocol=xmodem
w802.upload.maximum_size=2048576
w802.upload.maximum_data_size=294912
w802.build.mcu=ck804ef
w802.build.board=XT804_W802
w802.build.core=w806
w802.build.variant=w802
w802.build.mcpu=ck804ef
w802.serial.disableRTS=true
#---------------------------------------
# CPU Frequency
w802.menu.cpu_frq.240MHZ=240MHZ
w802.menu.cpu_frq.240MHZ.build.f_cpu=240000000
w802.menu.cpu_frq.160MHZ=160MHZ
w802.menu.cpu_frq.160MHZ.build.f_cpu=160000000
w802.menu.cpu_frq.80MHZ=80MHZ
w802.menu.cpu_frq.80MHZ.build.f_cpu=80000000
w802.menu.cpu_frq.40MHZ=40MHZ
w802.menu.cpu_frq.40MHZ.build.f_cpu=40000000
w802.menu.cpu_frq.2MHZ=2MHZ
w802.menu.cpu_frq.2MHZ.build.f_cpu=2000000
#---------------------------------------
# Release /Optimise
w802.menu.opt.default=Default (-O2 -g3)
w802.menu.opt.maxspeed=Maximum speed (-O3)
w802.menu.opt.maxspeed.build.flags.optimize=-O3
w802.menu.opt.minsize=Minimum code size ( -Os)
w802.menu.opt.minsize.build.flags.optimize=-Os
w802.menu.opt.debug=Debug (-g)
w802.menu.opt.debug.build.flags.optimize=-Og

#---------------------------------------
# Upload Speed
w802.menu.upload_speed.baud115200=115200
w802.menu.upload_speed.baud115200.upload.speed=115200
w802.menu.upload_speed.baud460800=460800
w802.menu.upload_speed.baud460800.upload.speed=460800
w802.menu.upload_speed.baud921600=921600
w802.menu.upload_speed.baud921600.upload.speed=921600
w802.menu.upload_speed.baud1000000=1000000
w802.menu.upload_speed.baud1000000.upload.speed=1000000
w802.menu.upload_speed.baud2000000=2000000
w802.menu.upload_speed.baud2000000.upload.speed=2000000
#---------------------------------------
# Erase Flash
w802.menu.erase.yes=erase all flash
w802.menu.erase.yes.erase.flash=all
w802.menu.erase.no=no erase
w802.menu.erase.no.erase.flash=none
##############################################################

##############################################################
w806.name=W806
w806.upload.tool=serial_upload
w806.upload.protocol=xmodem
w806.upload.maximum_size=1048576
w806.upload.maximum_data_size=294912
w806.build.mcu=ck804ef
w806.build.board=XT804_W806
w806.build.core=w806
w806.build.variant=w806
w806.build.mcpu=ck804ef
w806.serial.disableRTS=true
#---------------------------------------
# Release /Optimise
w806.menu.opt.default=Default (-O2 -g3)
#w806.menu.opt.release.build.flags.optimize=-Os -flto
w806.menu.opt.maxspeed=Maximum speed (-O3)
w806.menu.opt.maxspeed.build.flags.optimize=-O3
w806.menu.opt.minsize=Minimum code size ( -Os)
w806.menu.opt.minsize.build.flags.optimize=-Os
w806.menu.opt.debug=Debug (-g)
w806.menu.opt.debug.build.flags.optimize=-Og

#---------------------------------------
# Upload Speed
w806.menu.upload_speed.baud115200=115200
w806.menu.upload_speed.baud115200.upload.speed=115200
w806.menu.upload_speed.baud460800=460800
w806.menu.upload_speed.baud460800.upload.speed=460800
w806.menu.upload_speed.baud921600=921600
w806.menu.upload_speed.baud921600.upload.speed=921600
w806.menu.upload_speed.baud1000000=1000000
w806.menu.upload_speed.baud1000000.upload.speed=1000000
w806.menu.upload_speed.baud2000000=2000000
w806.menu.upload_speed.baud2000000.upload.speed=2000000
#---------------------------------------
# Erase Flash
w806.menu.erase.yes=erase all flash
w806.menu.erase.yes.erase.flash=all
w806.menu.erase.no=no erase
w806.menu.erase.no.erase.flash=none
#---------------------------------------
# CPU Frequency
w806.menu.cpu_frq.240MHZ=240MHZ
w806.menu.cpu_frq.240MHZ.build.f_cpu=240000000
w806.menu.cpu_frq.160MHZ=160MHZ
w806.menu.cpu_frq.160MHZ.build.f_cpu=160000000
w806.menu.cpu_frq.80MHZ=80MHZ
w806.menu.cpu_frq.80MHZ.build.f_cpu=80000000
w806.menu.cpu_frq.40MHZ=40MHZ
w806.menu.cpu_frq.40MHZ.build.f_cpu=40000000
w806.menu.cpu_frq.2MHZ=2MHZ
w806.menu.cpu_frq.2MHZ.build.f_cpu=2000000
##############################################################


##############################################################
air103.name=Air103
air103.upload.tool=serial_upload
air103.upload.protocol=xmodem
air103.upload.maximum_size=1048576
air103.upload.maximum_data_size=294912
air103.build.mcu=ck804ef
air103.build.board=XT804_Air103
air103.build.core=w806
air103.build.variant=air103
air103.build.mcpu=ck804ef
air103.serial.disableRTS=true

#---------------------------------------
# Release /Optimise
air103.menu.opt.default=Default (-O2 -g3)
#air103.menu.opt.release.build.flags.optimize=-Os -flto
air103.menu.opt.maxspeed=Maximum speed (-O3)
air103.menu.opt.maxspeed.build.flags.optimize=-O3
air103.menu.opt.minsize=Minimum code size ( -Os)
air103.menu.opt.minsize.build.flags.optimize=-Os
air103.menu.opt.debug=Debug (-g)
air103.menu.opt.debug.build.flags.optimize=-Og

#---------------------------------------
# Upload Speed
air103.menu.upload_speed.baud115200=115200
air103.menu.upload_speed.baud115200.upload.speed=115200
air103.menu.upload_speed.baud460800=460800
air103.menu.upload_speed.baud460800.upload.speed=460800
air103.menu.upload_speed.baud921600=921600
air103.menu.upload_speed.baud921600.upload.speed=921600
air103.menu.upload_speed.baud1000000=1000000
air103.menu.upload_speed.baud1000000.upload.speed=1000000
air103.menu.upload_speed.baud2000000=2000000
air103.menu.upload_speed.baud2000000.upload.speed=2000000
#---------------------------------------
# Erase Flash
air103.menu.erase.yes=erase all flash
air103.menu.erase.yes.erase.flash=all
air103.menu.erase.no=no erase
air103.menu.erase.no.erase.flash=none
#---------------------------------------
# CPU Frequency
air103.menu.cpu_frq.240MHZ=240MHZ
air103.menu.cpu_frq.240MHZ.build.f_cpu=240000000
air103.menu.cpu_frq.160MHZ=160MHZ
air103.menu.cpu_frq.160MHZ.build.f_cpu=160000000
air103.menu.cpu_frq.80MHZ=80MHZ
air103.menu.cpu_frq.80MHZ.build.f_cpu=80000000
air103.menu.cpu_frq.40MHZ=40MHZ
air103.menu.cpu_frq.40MHZ.build.f_cpu=40000000
air103.menu.cpu_frq.2MHZ=2MHZ
air103.menu.cpu_frq.2MHZ.build.f_cpu=2000000
